app/controllers/profile_controller.rb

UPDATE "users" SET "name" = $1, "nickname" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Huszák Richárd"], ["nickname", "Ricsi"], ["updated_at", "2018-10-09 10:25:25.625470"], ["id", 4]]
---
    def update
      if  params[:name] != nil
        current_user.name=params[:name]
      end
      if params[:nickname] != nil
        current_user.nickname=params[:nickname]
      end
      render json: {'success': current_user.save}